app/Controllers/Api/Auth.php

SELECT *
FROM `members`
WHERE `member_id` = '718338'
 LIMIT 1
---
    public function index()
    {
        /* $json = $this->request->getJSON(true); // true = return array

        if (!$json) {
            return $this->fail('Invalid JSON input');
        }

        $userModel = new MemberModel();
        $member_id = $json['member_id'] ?? null;
        $password  = $json['password'] ?? null; */
        $userModel = new MemberModel();
        $member_id = $this->request->getVar('form')->member_id;
        $password = $this->request->getVar('form')->password;
        $user = $userModel->where('member_id', $member_id)->first();

SELECT *
FROM `members`
WHERE `member_id` = '1'
---
    public function SponsorName()
    {
        $MM = new MemberModel();
        $sponsor_id =  $this->request->getVar()->sponsor_id;
        $sponsorD = $MM->where('member_id', $sponsor_id)->find();