app/Filters/ApiFilter.php

SELECT *
FROM `members`
WHERE `members`.`id` = '380'
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $session = Services::session();
        $key = getenv('JWT_SECRET');
        $header = $request->getHeader("Authorization");
        $token = null;

        // extract the token from the header
        if(!empty($header)) {
            if (preg_match('/Bearer\s(\S+)/', $header, $matches)) {
                $token = $matches[1];
            }
        }

        // check if token is null or empty
        if(is_null($token) || empty($token)) {
            $response = service('response');
            $response->setBody('Access denied');
            $response->setStatusCode(401);
            return $response;
        }

        try {

            $decoded = JWT::decode($token, new Key($key, 'HS256'));
            $session->set('id', $decoded->id);
            $session->set('member_id', $decoded->member_id);

            $MM = new MemberModel();
            $result = (object)$MM->find($decoded->id);