app/Models/Upgrade.php

INSERT INTO `upgrades` (`member_id`, `unit_upgrade`, `upgrade_amount`, `withdrawal_limit`, `daily`, `date`, `capping`) VALUES ('718338', 100, 100, 200, 0.5, '2025-09-13 08:55:14', 0)
INSERT INTO `txn_details` (`member_id`, `amount`, `type`, `date_created`) VALUES ('718338', 100, 'investment', '2025-09-13 08:55:14')
---
            $daily = ($amount * .5) / 100;

            $date = date('Y-m-d H:i:s');
            $result = $this->insert([
                'member_id' => $mid,
                'unit_upgrade' => $amount,
                'upgrade_amount' => $amount,
                'withdrawal_limit' => $withdrawal_limit,
                'daily' => $daily,
                'date' => $date,
                'capping' => $capping,
            ]);

            $TXND = new TxnDetails();
            $TXND->insert([
                'member_id' => $mid,
                'amount' => $amount,
                'type' => $type,
                'date_created' => $date,
            ]);